### Sourcing Open Data - Airport Traffic 2024

In [56]:
# Import the libiraties and the data set
import pandas as pd
import os

# File path and name
data_path = r'C:\\Users\\PC\\Desktop\\CareerFoundry Data Analytics\\airport_traffic_2024.csv'
data = pd.read_csv(data_path)

In [57]:
## Structure check and data types

In [58]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 114754 entries, 0 to 114753
Data columns (total 13 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   YEAR           114754 non-null  int64
 1   MONTH_NUM      114754 non-null  int64
 2   MONTH_MON      114754 non-null  object
 3   FLT_DATE       114754 non-null  object
 4   APT_ICAO       114754 non-null  object
 5   APT_NAME       114754 non-null  object
 6   STATE_NAME     114754 non-null  object
 7   FLT_DEP_1      114754 non-null  int64
 8   FLT_ARR_1      114754 non-null  int64
 9   FLT_TOT_1      114754 non-null  int64
 10  FLT_DEP_IFR_2  33164 non-null   float64
 11  FLT_ARR_IFR_2  33164 non-null   float64
 12  FLT_TOT_IFR_2  33164 non-null   float64
dtypes: float64(3), int64(5), object(5)
memory usage: 11.4+ MB

In [59]:
data.shape

(114754, 13)

In [60]:
data.head(5)

,YEAR,MONTH_NUM,MONTH_MON,FLT_DATE,APT_ICAO,APT_NAME,STATE_NAME,FLT_DEP_1,FLT_ARR_1,FLT_TOT_1,FLT_DEP_IFR_2,FLT_ARR_IFR_2,FLT_TOT_IFR_2
0,2024,1,JAN,2024-01-01,LATI,Tirana,Albania,73,74,147,NaN,NaN,NaN
1,2024,1,JAN,2024-01-01,UDYZ,Yerevan,Armenia,52,48,100,NaN,NaN,NaN
2,2024,1,JAN,2024-01-01,LOWG,Graz,Austria,6,8,14,NaN,NaN,NaN
3,2024,1,JAN,2024-01-01,LOWI,Innsbruck,Austria,22,25,47,NaN,NaN,NaN
4,2024,1,JAN,2024-01-01,LOWK,Klagenfurt,Austria,2,2,4,NaN,NaN,NaN

According to the source, the column FLT_TOT_1 represents the total number of flights reported by the Network Manager (NM â€“ 114.754 values). The last column, FLT_TOT_IFR2, also reports the total number of flights, but as provided by the Airport Operator (AO). Since there are only 33.164 AO values, this column cannot be used to cross-match the NM numbers. Therefore, the last three columns will be dropped and excluded from further analysis.
https://ansperformance.eu/reference/dataset/airport-traffic/

In [78]:
print(data.nunique())

Year                       1
Month Code                12
Month                     12
Flight Date              366
Airport ICAO Code        331
Airport Name             331
Country                   42
Number of Departures     781
Number of Arrivals       783
Total flights           1527
dtype: int64

In [61]:
## Check for missing values

In [62]:
missing_values = data.isnull().sum()
print(missing_values)

YEAR                 0
MONTH_NUM            0
MONTH_MON            0
FLT_DATE             0
APT_ICAO             0
APT_NAME             0
STATE_NAME           0
FLT_DEP_1            0
FLT_ARR_1            0
FLT_TOT_1            0
FLT_DEP_IFR_2    81590
FLT_ARR_IFR_2    81590
FLT_TOT_IFR_2    81590
dtype: int64

Since the data info and shape show that all relevant columns contain the same number of values (114.754) with no missing entries, this step can be skipped for this dataset.

In [63]:
## Remove the columns that are not required for the analysis

In [64]:
columns_to_drop = ['FLT_DEP_IFR_2' , 'FLT_ARR_IFR_2' , 'FLT_TOT_IFR_2']

In [65]:
data = data.drop(columns = columns_to_drop, errors = 'ignore')

In [66]:
data.shape

(114754, 10)

In [67]:
## Rename columns for better clarity and understanding

In [68]:
data = data.rename(columns={
    'YEAR': 'Year',
    'MONTH_NUM' : 'Month Code',           
    'MONTH_MON' : 'Month' ,            
    'FLT_DATE' : 'Flight Date' ,            
    'APT_ICAO' : 'Airport ICAO Code',              
    'APT_NAME' : 'Airport Name' ,             
    'STATE_NAME' : 'Country' ,            
    'FLT_DEP_1' : 'Number of Departures' ,             
    'FLT_ARR_1' : 'Number of Arrivals',        
    'FLT_TOT_1' : 'Total flights'
})

In [69]:
data.head(5)

,Year,Month Code,Month,Flight Date,Airport ICAO Code,Airport Name,Country,Number of Departures,Number of Arrivals,Total flights
0,2024,1,JAN,2024-01-01,LATI,Tirana,Albania,73,74,147
1,2024,1,JAN,2024-01-01,UDYZ,Yerevan,Armenia,52,48,100
2,2024,1,JAN,2024-01-01,LOWG,Graz,Austria,6,8,14
3,2024,1,JAN,2024-01-01,LOWI,Innsbruck,Austria,22,25,47
4,2024,1,JAN,2024-01-01,LOWK,Klagenfurt,Austria,2,2,4

In [ ]:
## Check for duplicates in the set

In [75]:
duplicates_exist = data.duplicated().any()
print(duplicates_exist)

False

There are no duplicate values in the data set.

In [ ]:
## Check for unique values

In [76]:
data.nunique()

Year                       1
Month Code                12
Month                     12
Flight Date              366
Airport ICAO Code        331
Airport Name             331
Country                   42
Number of Departures     781
Number of Arrivals       783
Total flights           1527
dtype: int64

In [70]:
## Export the cleaned data

In [74]:
data.to_csv(os.path.join(r'C:\\Users\\PC\\Desktop\\CareerFoundry Data Analytics\\airport_traffic_2024_clean.csv'))